node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1024
      }
    }
  }
}
node {
  name: "mul"
  op: "Mul"
  input: "global_step/read"
  input: "mul/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "mul_1/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "mul_1"
  op: "Mul"
  input: "mul"
  input: "mul_1/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/initial_learning_rate"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 4000000.0
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_1/x"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.949999988079071
      }
    }
  }
}
node {
  name: "ExponentialDecay/Cast_2"
  op: "Cast"
  input: "mul_1"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Truncate"
    value {
      b: false
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/truediv"
  op: "RealDiv"
  input: "ExponentialDecay/Cast_2"
  input: "ExponentialDecay/Cast/x"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Floor"
  op: "Floor"
  input: "ExponentialDecay/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay/Pow"
  op: "Pow"
  input: "ExponentialDecay/Cast_1/x"
  input: "ExponentialDecay/Floor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "ExponentialDecay"
  op: "Mul"
  input: "ExponentialDecay/initial_learning_rate"
  input: "ExponentialDecay/Pow"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "learning_rate/tags"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "learning_rate"
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "ScalarSummary"
  input: "learning_rate/tags"
  input: "ExponentialDecay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train_input/input_producer/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1444
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1444
          }
        }
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ft.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/k4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_a.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/8N.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/d5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/bk.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/VC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ey.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/A6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/T-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/8I.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/RA.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/X_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gY.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1q.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2u.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ZF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/lH.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/56.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/vx.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1E.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/wv.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/R9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dq.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J2.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/10.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/G4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/36.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/59.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-k.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/g_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/U8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/S4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/S8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/r5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/bf.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/0I.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/FC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/U5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/jL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/83.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/QV.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/px.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/T8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/t_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9L.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Cb.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/DX.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/L_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/33.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ka.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/kZ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_S.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/R_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/XE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/A3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/M5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/W2.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/RW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2d.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/td.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_O.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4a.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/OX.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/NR.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/i3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9D.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1S.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/D7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Wi.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/H8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/E8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/oN.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ir.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/aF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/yS.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/RQ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/AB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ao.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Z_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ld.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/nF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/88.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/sa.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/lx.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/sR.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-L.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/kM.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/PP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/rL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/zT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/S0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-Y.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/HD.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5L.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/nC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/bg.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3O.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5q.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/eO.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Pg.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/79.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/uw.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gt.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/UH.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/W0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ZR.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/v3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/yE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Tx.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/95.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ky.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/VV.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Gk.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/0-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/sG.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qx.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qm.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/SK.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Z1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Bp.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2y.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/TC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/G8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/RX.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/MS.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/QB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Z9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/V6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/W8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Vq.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ij.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/m0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/po.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/EA.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/e0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/W_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/UQ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1d.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/lW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/HW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/hL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Y4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/i9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/pC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gs.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/22.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7c.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/w4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/85.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Cn.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/xj.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/TB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-O.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/DT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dj.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/XF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6R.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Zd.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/96.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/M6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dI.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Bb.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Yn.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/20.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Lj.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/lT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2B.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Hv.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/g2.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/CA.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1v.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/o1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/jf.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/V_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/H6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6O.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/MO.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tY.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/c9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qD.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/27.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/21.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/H1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/97.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/p3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/uk.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Dh.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/QE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/06.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ci.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/o3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Md.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/MW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/K5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/DB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/co.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5Z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/cz.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/e7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/PB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/DD.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/RG.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/8P.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/o6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/VE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qZ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/GO.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7j.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/pm.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/I8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/j3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Op.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Kr.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/8D.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4n.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/D0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/mP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/wH.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/X0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5v.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ff.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/vR.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/30.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_Y.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/SI.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/XQ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3g.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6H.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Em.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/X5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/os.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Jk.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/0w.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9x.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/jG.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/aT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gq.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2T.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/xI.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/v1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/i0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/oq.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5b.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Hr.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ZC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-a.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/pU.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Zi.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/98.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3N.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_k.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/jz.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/A5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Re.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dO.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/BQ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6Z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6V.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gA.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Fd.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/N9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/rP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/x4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/b9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_u.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/wT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/LV.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Oc.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/kF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7N.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/MT.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/pE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/00.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/u0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_j.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/LS.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/fJ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/mc.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/KO.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-U.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/yW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/kd.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/xL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/02.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/hy.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3J.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/32.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/sd.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ZA.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/EZ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/h4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Kv.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Y1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/k8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/a4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/F_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/TW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7b.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/cS.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/n0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/25.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/nq.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/sZ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ud.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/qW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7O.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/G5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/fP.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4Y.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Nk.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/pW.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/y9.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/12.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ET.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Qs.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/kC.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_r.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5w.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/lF.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/09.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/KJ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/He.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3r.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/39.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/l7.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/F0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/v2.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/y8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dG.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/8Z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/s1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1R.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/wu.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/aj.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2e.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Cr.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4_.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/6m.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/mE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/jM.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/LE.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/14.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/C6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/N3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/D1.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/f4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/0A.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/D4.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Gw.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tV.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/i-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-P.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2r.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/q8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/E2.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/QQ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Hb.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/40.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/dl.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/C5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/o-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/r6.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Ni.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/yZ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7z.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1m.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/wz.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/VB.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2a.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/SJ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/tm.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/_n.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/w-.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/ki.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/yL.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/oi.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/3q.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9o.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/n8.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/bm.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/VJ.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/Oh.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2N.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/-D.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/gb.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/7d.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9g.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/13.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/2p.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/w5.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/zm.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/J0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/q0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/E3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/4b.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/r0.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/5T.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/1n.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/R3.tfrecord"
        string_val: "/home/ubuntu/EE542_final_project/audioset_v1_embeddings/unbal_train/9_.tfrecord"
